# AccessDeniedException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AccessDeniedException Class
Members See Also
---
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class AccessDeniedException : ApplicationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class AccessDeniedException _
	Inherits ApplicationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class AccessDeniedException : public ApplicationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..AccessDeniedException
# See Also
AccessDeniedException Members
Autodesk.Revit.Exceptions Namespace